src/Documents/уатОперацииСТехническимиЖидкостями/уатОперацииСТехническимиЖидкостями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатОперацииСТехническимиЖидкостями</name>
  <registerRecords>AccumulationRegister.уатОстаткиТЖнаТС</registerRecords>
  <registerRecords>AccumulationRegister.уатПартииТоваровНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.уатОборотыТЖнаТС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>Вид операции</comment>
    <type>
      <types>EnumRef.уатВидыОперацийСТехническимиЖидкостями</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТехническиеЖидкости</name>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/уатВидыОперацийСТехническимиЖидкостями/уатВидыОперацийСТехническимиЖидкостями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОперацийСТехническимиЖидкостями</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>РасходВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасходПрочее</name>
  </enumValues>
  <enumValues>
    <name>ДоливПоАкту</name>
  </enumValues>
  <enumValues>
    <name>ДоливПоТО</name>
  </enumValues>
  <enumValues>
    <name>ДоливПрочее</name>
  </enumValues>
  <enumValues>
    <name>Слив</name>
  </enumValues>
</mdclass:Enum>

src/Documents/уатОперацииСТехническимиЖидкостями/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	// Инициализация дополнительных свойств для проведения документа.
    уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
    
    // Инициализация данных документа.
    Документы.уатОперацииСТехническимиЖидкостями.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
    // Подготовка наборов записей.
    уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
    
    // Отражение в разделах учета.
	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
				ПланыВидовХарактеристик.уатПраваИНастройки.ВестиСкладскойУчетУАТ) 
	 И (ВидОперации <> Перечисления.уатВидыОперацийСТехническимиЖидкостями.РасходПрочее) Тогда
		уатПроведение.ОтразитьПартииТоваровНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	уатПроведение.ОтразитьРасходТЖ(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение.ОтразитьПартииТЖ(ДополнительныеСвойства, Движения, Отказ);

    // Запись наборов записей.
    уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
    
    // Контроль возникновения отрицательного остатка.
	Документы.уатОперацииСТехническимиЖидкостями.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Заголовок = НСтр("en='Holding the document ';ru='Проведение документа '") + Ссылка;
	Если ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПоАкту
		ИЛИ ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПоТО
		ИЛИ ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.ДоливПрочее
		ИЛИ ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.Слив Тогда
		СтруктураШапкиДокумента = Новый Структура("ВидОперации, Организация, Склад");
	Иначе
		СтруктураШапкиДокумента = Новый Структура("ВидОперации, Организация");
	КонецЕСли;
	уатОбщегоНазначенияТиповые.уатПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура("ТС, Водитель, Номенклатура, Количество");
	уатОбщегоНазначенияТиповые.уатПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ТехническиеЖидкости", СтруктураПолей,
		Отказ, Заголовок);
		
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	уатОбщегоНазначенияСервер.ПроверкаСоответствияМестонахожденияТС(ЭтотОбъект, Отказ, "ТехническиеЖидкости", Заголовок);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	МассивТС = Новый Массив();
	Для Каждого ТекСтрока Из ТехническиеЖидкости Цикл 
		Если МассивТС.Найти(ТекСтрока.ТС) = Неопределено Тогда 
			МассивТС.Добавить(ТекСтрока.ТС);
		КонецЕсли;
	КонецЦикла;
	
	СписокТС = "";
	Для Каждого ТекТС Из МассивТС Цикл 
		СписокТС = СписокТС + ?(СписокТС = "", "", ", ") + ТекТС.Наименование;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

#КонецОбласти


#КонецЕсли
